'''
5.	Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
Пример:
o	A (3,6); B (2,1) -> 5,09
o	A (7,-5); B (1,-1) -> 7,21
'''
from math import sqrt

def len_A_B(A, B):
    return sqrt((A[0]-B[0]) ** 2 + (A[1]-B[1]) ** 2)

if __name__ == "__main__":
    A = []
    B = []

    X = int(input("Введите координату Х точки А: "))
    A.append(X)
    Y = int(input("Введите координату Y точки А: "))
    A.append(Y)

    X = int(input("Введите координату Х точки B: "))
    B.append(X)
    Y = int(input("Введите координату Y точки B: "))
    B.append(Y)

    print(f'A({A[0]},{A[1]}); B({B[0]},{B[1]}) -> {len_A_B(A, B)}')

